ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/pmc.h
/* ---------------------------------------------------------------------------- */
/*                Microchip Microcontroller Software Support                    */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) %copyright_year%, Microchip Technology Inc.                    */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Microchip's name may not be used to endorse or promote products derived from */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  */
/* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES */
/* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    */
/* ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; */
/* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  */
/* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   */
/* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     */
/* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            */
/* ---------------------------------------------------------------------------- */

#ifndef _PIC32CX_PMC_COMPONENT_
#define _PIC32CX_PMC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Power Management Controller */
/* ============================================================================= */
/** \addtogroup PIC32CX_PMC Power Management Controller */
/*@{*/

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief Pmc hardware registers */
typedef struct {
	__O uint32_t PMC_SCER;  /**< \brief (Pmc Offset: 0x0) System Clock Enable Register */
	__O uint32_t PMC_SCDR;  /**< \brief (Pmc Offset: 0x4) System Clock Disable Register */
	__I uint32_t PMC_SCSR;  /**< \brief (Pmc Offset: 0x8) System Clock Status Register */
	__IO uint32_t PMC_PLL_CTRL0; /**< \brief (Pmc Offset: 0xC) PLL Control Register 0 */
	__IO uint32_t PMC_PLL_CTRL1; /**< \brief (Pmc Offset: 0x10) PLL Control Register 1 */
	__IO uint32_t PMC_PLL_CTRL2; /**< \brief (Pmc Offset: 0x14) PLL Control Register 2 */
	__IO uint32_t PMC_PLL_SSR; /**< \brief (Pmc Offset: 0x18) PLL Spread Spectrum Register */
	__IO uint32_t PMC_PLL_ACR; /**< \brief (Pmc Offset: 0x1C) PLL Analog Control Register */
	__IO uint32_t PMC_PLL_UPDT; /**< \brief (Pmc Offset: 0x20) PLL Update Register */
	__IO uint32_t CKGR_MOR; /**< \brief (Pmc Offset: 0x24) Main Oscillator Register */
	__IO uint32_t CKGR_MCFR; /**< \brief (Pmc Offset: 0x28) Main Clock Frequency Register */
	__IO uint32_t PMC_CPU_CKR; /**< \brief (Pmc Offset: 0x2C) CPU Clock Register */
	__IO uint32_t PMC_CPU_RATIO; /**< \brief (Pmc Offset: 0x30) CPU Clock Ratio Register */
	__I uint32_t Reserved2[4];
	__IO uint32_t PMC_PCK[3]; /**< \brief (Pmc Offset: 0x44) Programmable Clock Register (chid = 0) */
	__I uint32_t Reserved3[5];
	__O uint32_t PMC_IER;   /**< \brief (Pmc Offset: 0x64) Interrupt Enable Register */
	__O uint32_t PMC_IDR;   /**< \brief (Pmc Offset: 0x68) Interrupt Disable Register */
	__I uint32_t PMC_SR;    /**< \brief (Pmc Offset: 0x6C) Status Register */
	__I uint32_t PMC_IMR;   /**< \brief (Pmc Offset: 0x70) Interrupt Mask Register */
	__IO uint32_t PMC_FSMR; /**< \brief (Pmc Offset: 0x74) Fast Start-up Mode Register */
	__IO uint32_t PMC_WCR;  /**< \brief (Pmc Offset: 0x78) Wake-up Control Register */
	__O uint32_t PMC_FOCR;  /**< \brief (Pmc Offset: 0x7C) Fault Output Clear Register */
	__IO uint32_t PMC_CPFSMR; /**< \brief (Pmc Offset: 0x80) Coprocessor Fast Start-up Mode Register */
	__IO uint32_t PMC_WPMR; /**< \brief (Pmc Offset: 0x84) Write Protection Mode Register */
	__I uint32_t PMC_WPSR;  /**< \brief (Pmc Offset: 0x88) Write Protection Status Register */
	__IO uint32_t PMC_PCR;  /**< \brief (Pmc Offset: 0x8C) Peripheral Control Register */
	__IO uint32_t PMC_OCR;  /**< \brief (Pmc Offset: 0x90) Oscillator Calibration Register */
	__I uint32_t PMC_SLPWK_AIPR; /**< \brief (Pmc Offset: 0x94) SleepWalking Activity In Progress Register */
	__IO uint32_t PMC_SLPWKCR; /**< \brief (Pmc Offset: 0x98) SleepWalking Control Register */
	__I uint32_t Reserved4[1];
	__IO uint32_t PMC_MCKLIM; /**< \brief (Pmc Offset: 0xA0) MCK0 Monitor Limits Register */
	__I uint32_t PMC_CSR0;  /**< \brief (Pmc Offset: 0xA4) Peripheral Clock Status Register 0 */
	__I uint32_t PMC_CSR1;  /**< \brief (Pmc Offset: 0xA8) Peripheral Clock Status Register 1 */
	__I uint32_t PMC_CSR2;  /**< \brief (Pmc Offset: 0xAC) Peripheral Clock Status Register 2 */
	__I uint32_t PMC_CSR3;  /**< \brief (Pmc Offset: 0xB0) Peripheral Clock Status Register 3 */
	__I uint32_t Reserved5[4];
	__I uint32_t PMC_GCSR0; /**< \brief (Pmc Offset: 0xC4) Generic Clock Status Register 0 */
	__I uint32_t PMC_GCSR1; /**< \brief (Pmc Offset: 0xC8) Generic Clock Status Register 1 */
	__I uint32_t PMC_GCSR2; /**< \brief (Pmc Offset: 0xCC) Generic Clock Status Register 2 */
	__I uint32_t PMC_GCSR3; /**< \brief (Pmc Offset: 0xD0) Generic Clock Status Register 3 */
	__I uint32_t Reserved6[4];
	__O uint32_t PMC_PLL_IER; /**< \brief (Pmc Offset: 0xE4) PLL Interrupt Enable Register */
	__O uint32_t PMC_PLL_IDR; /**< \brief (Pmc Offset: 0xE8) PLL Interrupt Disable Register */
	__I uint32_t PMC_PLL_IMR; /**< \brief (Pmc Offset: 0xEC) PLL Interrupt Mask Register */
	__I uint32_t PMC_PLL_ISR0; /**< \brief (Pmc Offset: 0xF0) PLL Interrupt Status Register 0 */
	__I uint32_t PMC_PLL_ISR1; /**< \brief (Pmc Offset: 0xF4) PLL Interrupt Status Register 1 */
} Pmc;
