ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/pmc.h
#define   PMC_PCR_GCLKCSS_PLLACK1 (0x4u << 8) /**< \brief (PMC_PCR) PLLACK1 is selected. */
#define   PMC_PCR_GCLKCSS_PLLBCK (0x5u << 8) /**< \brief (PMC_PCR) PLLBCK is selected. */
#define   PMC_PCR_GCLKCSS_PLLCCK (0x6u << 8) /**< \brief (PMC_PCR) PLLCCK is selected. */
#define   PMC_PCR_GCLKCSS_PLLCSRC (0x7u << 8) /**< \brief (PMC_PCR) PLLCSRC is selected. */
#define PMC_PCR_DIV_Pos 14
#define PMC_PCR_DIV_Msk (0x3u << PMC_PCR_DIV_Pos) /**< \brief (PMC_PCR) Peripheral Clock Division Ratio */
#define PMC_PCR_DIV(value) ((PMC_PCR_DIV_Msk & ((value) << PMC_PCR_DIV_Pos)))
#define   PMC_PCR_DIV_DIV1 (0x0u << 14) /**< \brief (PMC_PCR) Associated GCLKx is divided by 1. */
#define   PMC_PCR_DIV_DIV2 (0x1u << 14) /**< \brief (PMC_PCR) Associated GCLKx is divided by 2. */
#define   PMC_PCR_DIV_DIV4 (0x2u << 14) /**< \brief (PMC_PCR) Associated GCLKx is divided by 4. */
#define   PMC_PCR_DIV_DIV8 (0x3u << 14) /**< \brief (PMC_PCR) Associated GCLKx is divided by 8. */
#define PMC_PCR_MCKID_Pos 16
#define PMC_PCR_MCKID_Msk (0xfu << PMC_PCR_MCKID_Pos) /**< \brief (PMC_PCR) Master Clock Index (Read-only) */
#define PMC_PCR_MCKID(value) ((PMC_PCR_MCKID_Msk & ((value) << PMC_PCR_MCKID_Pos)))
#define PMC_PCR_GCLKDIV_Pos 20
#define PMC_PCR_GCLKDIV_Msk (0xffu << PMC_PCR_GCLKDIV_Pos) /**< \brief (PMC_PCR) Generic Clock Division Ratio */
#define PMC_PCR_GCLKDIV(value) ((PMC_PCR_GCLKDIV_Msk & ((value) << PMC_PCR_GCLKDIV_Pos)))
#define PMC_PCR_EN (0x1u << 28) /**< \brief (PMC_PCR) Enable */
#define PMC_PCR_GCLKEN (0x1u << 29) /**< \brief (PMC_PCR) Generic Clock Enable */
#define PMC_PCR_CMD (0x1u << 31) /**< \brief (PMC_PCR) Command */
/* -------- PMC_OCR : (PMC Offset: 0x90) Oscillator Calibration Register -------- */
#define PMC_OCR_CAL12_Pos 16
#define PMC_OCR_CAL12_Msk (0x7fu << PMC_OCR_CAL12_Pos) /**< \brief (PMC_OCR) Main RC Oscillator Calibration Bits */
#define PMC_OCR_CAL12(value) ((PMC_OCR_CAL12_Msk & ((value) << PMC_OCR_CAL12_Pos)))
#define PMC_OCR_SEL12 (0x1u << 23) /**< \brief (PMC_OCR) Selection of Main RC Oscillator Calibration Bits */
/* -------- PMC_SLPWK_AIPR : (PMC Offset: 0x94) SleepWalking Activity In Progress Register -------- */
#define PMC_SLPWK_AIPR_AIP (0x1u << 0) /**< \brief (PMC_SLPWK_AIPR) Activity In Progress */
/* -------- PMC_SLPWKCR : (PMC Offset: 0x98) SleepWalking Control Register -------- */
#define PMC_SLPWKCR_PID_Pos 0
#define PMC_SLPWKCR_PID_Msk (0x7fu << PMC_SLPWKCR_PID_Pos) /**< \brief (PMC_SLPWKCR) Peripheral ID */
#define PMC_SLPWKCR_PID(value) ((PMC_SLPWKCR_PID_Msk & ((value) << PMC_SLPWKCR_PID_Pos)))
#define PMC_SLPWKCR_CMD (0x1u << 12) /**< \brief (PMC_SLPWKCR) Command */
#define PMC_SLPWKCR_ASR (0x1u << 16) /**< \brief (PMC_SLPWKCR) Activity Status Register */
#define PMC_SLPWKCR_SLPWKSR (0x1u << 28) /**< \brief (PMC_SLPWKCR) SleepWalking Sleep Register */
/* -------- PMC_MCKLIM : (PMC Offset: 0xA0) MCK0 Monitor Limits Register -------- */
#define PMC_MCKLIM_MCK_LOW_IT_Pos 0
#define PMC_MCKLIM_MCK_LOW_IT_Msk (0xffu << PMC_MCKLIM_MCK_LOW_IT_Pos) /**< \brief (PMC_MCKLIM) MCK0 Monitoring Low IT Limit */
#define PMC_MCKLIM_MCK_LOW_IT(value) ((PMC_MCKLIM_MCK_LOW_IT_Msk & ((value) << PMC_MCKLIM_MCK_LOW_IT_Pos)))
#define PMC_MCKLIM_MCK_HIGH_IT_Pos 8
#define PMC_MCKLIM_MCK_HIGH_IT_Msk (0xffu << PMC_MCKLIM_MCK_HIGH_IT_Pos) /**< \brief (PMC_MCKLIM) MCK0 Monitoring High IT Limit */
#define PMC_MCKLIM_MCK_HIGH_IT(value) ((PMC_MCKLIM_MCK_HIGH_IT_Msk & ((value) << PMC_MCKLIM_MCK_HIGH_IT_Pos)))
#define PMC_MCKLIM_MCK_LOW_RES_Pos 16
#define PMC_MCKLIM_MCK_LOW_RES_Msk (0xffu << PMC_MCKLIM_MCK_LOW_RES_Pos) /**< \brief (PMC_MCKLIM) MCK0 Monitoring Low RESET Limit */
#define PMC_MCKLIM_MCK_LOW_RES(value) ((PMC_MCKLIM_MCK_LOW_RES_Msk & ((value) << PMC_MCKLIM_MCK_LOW_RES_Pos)))
#define PMC_MCKLIM_MCK_HIGH_RES_Pos 24
#define PMC_MCKLIM_MCK_HIGH_RES_Msk (0xffu << PMC_MCKLIM_MCK_HIGH_RES_Pos) /**< \brief (PMC_MCKLIM) MCK0 Monitoring High Reset Limit */
#define PMC_MCKLIM_MCK_HIGH_RES(value) ((PMC_MCKLIM_MCK_HIGH_RES_Msk & ((value) << PMC_MCKLIM_MCK_HIGH_RES_Pos)))
/* -------- PMC_CSR0 : (PMC Offset: 0xA4) Peripheral Clock Status Register 0 -------- */
#define PMC_CSR0_PID9 (0x1u << 9) /**< \brief (PMC_CSR0) Peripheral Clock 9 Status */
#define PMC_CSR0_PID10 (0x1u << 10) /**< \brief (PMC_CSR0) Peripheral Clock 10 Status */
#define PMC_CSR0_PID11 (0x1u << 11) /**< \brief (PMC_CSR0) Peripheral Clock 11 Status */
#define PMC_CSR0_PID12 (0x1u << 12) /**< \brief (PMC_CSR0) Peripheral Clock 12 Status */
#define PMC_CSR0_PID13 (0x1u << 13) /**< \brief (PMC_CSR0) Peripheral Clock 13 Status */
#define PMC_CSR0_PID14 (0x1u << 14) /**< \brief (PMC_CSR0) Peripheral Clock 14 Status */
#define PMC_CSR0_PID15 (0x1u << 15) /**< \brief (PMC_CSR0) Peripheral Clock 15 Status */
#define PMC_CSR0_PID16 (0x1u << 16) /**< \brief (PMC_CSR0) Peripheral Clock 16 Status */
#define PMC_CSR0_PID17 (0x1u << 17) /**< \brief (PMC_CSR0) Peripheral Clock 17 Status */
#define PMC_CSR0_PID23 (0x1u << 23) /**< \brief (PMC_CSR0) Peripheral Clock 23 Status */
#define PMC_CSR0_PID24 (0x1u << 24) /**< \brief (PMC_CSR0) Peripheral Clock 24 Status */
#define PMC_CSR0_PID25 (0x1u << 25) /**< \brief (PMC_CSR0) Peripheral Clock 25 Status */
#define PMC_CSR0_PID28 (0x1u << 28) /**< \brief (PMC_CSR0) Peripheral Clock 28 Status */
#define PMC_CSR0_PID30 (0x1u << 30) /**< \brief (PMC_CSR0) Peripheral Clock 30 Status */
#define PMC_CSR0_PID31 (0x1u << 31) /**< \brief (PMC_CSR0) Peripheral Clock 31 Status */
/* -------- PMC_CSR1 : (PMC Offset: 0xA8) Peripheral Clock Status Register 1 -------- */
#define PMC_CSR1_PID32 (0x1u << 0) /**< \brief (PMC_CSR1) Peripheral Clock 32 Status */
#define PMC_CSR1_PID33 (0x1u << 1) /**< \brief (PMC_CSR1) Peripheral Clock 33 Status */
#define PMC_CSR1_PID34 (0x1u << 2) /**< \brief (PMC_CSR1) Peripheral Clock 34 Status */
#define PMC_CSR1_PID35 (0x1u << 3) /**< \brief (PMC_CSR1) Peripheral Clock 35 Status */
#define PMC_CSR1_PID36 (0x1u << 4) /**< \brief (PMC_CSR1) Peripheral Clock 36 Status */
#define PMC_CSR1_PID37 (0x1u << 5) /**< \brief (PMC_CSR1) Peripheral Clock 37 Status */
#define PMC_CSR1_PID38 (0x1u << 6) /**< \brief (PMC_CSR1) Peripheral Clock 38 Status */
#define PMC_CSR1_PID39 (0x1u << 7) /**< \brief (PMC_CSR1) Peripheral Clock 39 Status */
#define PMC_CSR1_PID49 (0x1u << 17) /**< \brief (PMC_CSR1) Peripheral Clock 49 Status */
#define PMC_CSR1_PID51 (0x1u << 19) /**< \brief (PMC_CSR1) Peripheral Clock 51 Status */
#define PMC_CSR1_PID53 (0x1u << 21) /**< \brief (PMC_CSR1) Peripheral Clock 53 Status */
#define PMC_CSR1_PID55 (0x1u << 23) /**< \brief (PMC_CSR1) Peripheral Clock 55 Status */
#define PMC_CSR1_PID57 (0x1u << 25) /**< \brief (PMC_CSR1) Peripheral Clock 57 Status */
#define PMC_CSR1_PID59 (0x1u << 27) /**< \brief (PMC_CSR1) Peripheral Clock 59 Status */
/* -------- PMC_CSR2 : (PMC Offset: 0xAC) Peripheral Clock Status Register 2 -------- */
#define PMC_CSR2_PID75 (0x1u << 11) /**< \brief (PMC_CSR2) Peripheral Clock 75 Status */
#define PMC_CSR2_PID78 (0x1u << 14) /**< \brief (PMC_CSR2) Peripheral Clock 78 Status */
#define PMC_CSR2_PID79 (0x1u << 15) /**< \brief (PMC_CSR2) Peripheral Clock 79 Status */
#define PMC_CSR2_PID80 (0x1u << 16) /**< \brief (PMC_CSR2) Peripheral Clock 80 Status */
#define PMC_CSR2_PID81 (0x1u << 17) /**< \brief (PMC_CSR2) Peripheral Clock 81 Status */
#define PMC_CSR2_PID85 (0x1u << 21) /**< \brief (PMC_CSR2) Peripheral Clock 85 Status */
#define PMC_CSR2_PID87 (0x1u << 23) /**< \brief (PMC_CSR2) Peripheral Clock 87 Status */
#define PMC_CSR2_PID88 (0x1u << 24) /**< \brief (PMC_CSR2) Peripheral Clock 88 Status */
#define PMC_CSR2_PID89 (0x1u << 25) /**< \brief (PMC_CSR2) Peripheral Clock 89 Status */
#define PMC_CSR2_PID90 (0x1u << 26) /**< \brief (PMC_CSR2) Peripheral Clock 90 Status */
#define PMC_CSR2_PID91 (0x1u << 27) /**< \brief (PMC_CSR2) Peripheral Clock 91 Status */
/* -------- PMC_CSR3 : (PMC Offset: 0xB0) Peripheral Clock Status Register 3 -------- */
#define PMC_CSR3_PID96 (0x1u << 0) /**< \brief (PMC_CSR3) Peripheral Clock 96 Status */
/* -------- PMC_GCSR0 : (PMC Offset: 0xC4) Generic Clock Status Register 0 -------- */
#define PMC_GCSR0_GPID9 (0x1u << 9) /**< \brief (PMC_GCSR0) Generic Clock 9 Status */
#define PMC_GCSR0_GPID10 (0x1u << 10) /**< \brief (PMC_GCSR0) Generic Clock 10 Status */
#define PMC_GCSR0_GPID11 (0x1u << 11) /**< \brief (PMC_GCSR0) Generic Clock 11 Status */
#define PMC_GCSR0_GPID12 (0x1u << 12) /**< \brief (PMC_GCSR0) Generic Clock 12 Status */
#define PMC_GCSR0_GPID13 (0x1u << 13) /**< \brief (PMC_GCSR0) Generic Clock 13 Status */
#define PMC_GCSR0_GPID14 (0x1u << 14) /**< \brief (PMC_GCSR0) Generic Clock 14 Status */
#define PMC_GCSR0_GPID15 (0x1u << 15) /**< \brief (PMC_GCSR0) Generic Clock 15 Status */
#define PMC_GCSR0_GPID16 (0x1u << 16) /**< \brief (PMC_GCSR0) Generic Clock 16 Status */
#define PMC_GCSR0_GPID23 (0x1u << 23) /**< \brief (PMC_GCSR0) Generic Clock 23 Status */
#define PMC_GCSR0_GPID24 (0x1u << 24) /**< \brief (PMC_GCSR0) Generic Clock 24 Status */
#define PMC_GCSR0_GPID31 (0x1u << 31) /**< \brief (PMC_GCSR0) Generic Clock 31 Status */
/* -------- PMC_GCSR1 : (PMC Offset: 0xC8) Generic Clock Status Register 1 -------- */
#define PMC_GCSR1_GPID34 (0x1u << 2) /**< \brief (PMC_GCSR1) Generic Clock 34 Status */
#define PMC_GCSR1_GPID37 (0x1u << 5) /**< \brief (PMC_GCSR1) Generic Clock 37 Status */
/* -------- PMC_GCSR2 : (PMC Offset: 0xCC) Generic Clock Status Register 2 -------- */
#define PMC_GCSR2_GPID75 (0x1u << 11) /**< \brief (PMC_GCSR2) Generic Clock 75 Status */
#define PMC_GCSR2_GPID79 (0x1u << 15) /**< \brief (PMC_GCSR2) Generic Clock 79 Status */
#define PMC_GCSR2_GPID87 (0x1u << 23) /**< \brief (PMC_GCSR2) Generic Clock 87 Status */
#define PMC_GCSR2_GPID89 (0x1u << 25) /**< \brief (PMC_GCSR2) Generic Clock 89 Status */
#define PMC_GCSR2_GPID90 (0x1u << 26) /**< \brief (PMC_GCSR2) Generic Clock 90 Status */
/* -------- PMC_GCSR3 : (PMC Offset: 0xD0) Generic Clock Status Register 3 -------- */
#define PMC_GCSR3_GPID96 (0x1u << 0) /**< \brief (PMC_GCSR3) Generic Clock 96 Status */
/* -------- PMC_PLL_IER : (PMC Offset: 0xE4) PLL Interrupt Enable Register -------- */
#define PMC_PLL_IER_LOCK0 (0x1u << 0) /**< \brief (PMC_PLL_IER) PLL of Index 0 Lock Interrupt Enable */
#define PMC_PLL_IER_LOCK1 (0x1u << 1) /**< \brief (PMC_PLL_IER) PLL of Index 1 Lock Interrupt Enable */
#define PMC_PLL_IER_LOCK2 (0x1u << 2) /**< \brief (PMC_PLL_IER) PLL of Index 2 Lock Interrupt Enable */
#define PMC_PLL_IER_UNLOCK0 (0x1u << 16) /**< \brief (PMC_PLL_IER) PLL of Index 0 Unlock Interrupt Enable */
#define PMC_PLL_IER_UNLOCK1 (0x1u << 17) /**< \brief (PMC_PLL_IER) PLL of Index 1 Unlock Interrupt Enable */
#define PMC_PLL_IER_UNLOCK2 (0x1u << 18) /**< \brief (PMC_PLL_IER) PLL of Index 2 Unlock Interrupt Enable */
/* -------- PMC_PLL_IDR : (PMC Offset: 0xE8) PLL Interrupt Disable Register -------- */
#define PMC_PLL_IDR_LOCK0 (0x1u << 0) /**< \brief (PMC_PLL_IDR) PLL of Index 0 Lock Interrupt Disable */
#define PMC_PLL_IDR_LOCK1 (0x1u << 1) /**< \brief (PMC_PLL_IDR) PLL of Index 1 Lock Interrupt Disable */
#define PMC_PLL_IDR_LOCK2 (0x1u << 2) /**< \brief (PMC_PLL_IDR) PLL of Index 2 Lock Interrupt Disable */
#define PMC_PLL_IDR_UNLOCK0 (0x1u << 16) /**< \brief (PMC_PLL_IDR) PLL of Index 0 Unlock Interrupt Disable */
#define PMC_PLL_IDR_UNLOCK1 (0x1u << 17) /**< \brief (PMC_PLL_IDR) PLL of Index 1 Unlock Interrupt Disable */
#define PMC_PLL_IDR_UNLOCK2 (0x1u << 18) /**< \brief (PMC_PLL_IDR) PLL of Index 2 Unlock Interrupt Disable */
/* -------- PMC_PLL_IMR : (PMC Offset: 0xEC) PLL Interrupt Mask Register -------- */
#define PMC_PLL_IMR_LOCK0 (0x1u << 0) /**< \brief (PMC_PLL_IMR) PLL of Index 0 Lock Interrupt Mask */
#define PMC_PLL_IMR_LOCK1 (0x1u << 1) /**< \brief (PMC_PLL_IMR) PLL of Index 1 Lock Interrupt Mask */
#define PMC_PLL_IMR_LOCK2 (0x1u << 2) /**< \brief (PMC_PLL_IMR) PLL of Index 2 Lock Interrupt Mask */
#define PMC_PLL_IMR_UNLOCK0 (0x1u << 16) /**< \brief (PMC_PLL_IMR) PLL of Index 0 Unlock Interrupt Mask */
#define PMC_PLL_IMR_UNLOCK1 (0x1u << 17) /**< \brief (PMC_PLL_IMR) PLL of Index 1 Unlock Interrupt Mask */
#define PMC_PLL_IMR_UNLOCK2 (0x1u << 18) /**< \brief (PMC_PLL_IMR) PLL of Index 2 Unlock Interrupt Mask */
/* -------- PMC_PLL_ISR0 : (PMC Offset: 0xF0) PLL Interrupt Status Register 0 -------- */
#define PMC_PLL_ISR0_LOCK0 (0x1u << 0) /**< \brief (PMC_PLL_ISR0) PLL of Index 0 Lock Interrupt Status */
#define PMC_PLL_ISR0_LOCK1 (0x1u << 1) /**< \brief (PMC_PLL_ISR0) PLL of Index 1 Lock Interrupt Status */
#define PMC_PLL_ISR0_LOCK2 (0x1u << 2) /**< \brief (PMC_PLL_ISR0) PLL of Index 2 Lock Interrupt Status */
#define PMC_PLL_ISR0_UNLOCK0 (0x1u << 16) /**< \brief (PMC_PLL_ISR0) PLL of Index 0 Unlock Interrupt Status */
#define PMC_PLL_ISR0_UNLOCK1 (0x1u << 17) /**< \brief (PMC_PLL_ISR0) PLL of Index 1 Unlock Interrupt Status */
#define PMC_PLL_ISR0_UNLOCK2 (0x1u << 18) /**< \brief (PMC_PLL_ISR0) PLL of Index 2 Unlock Interrupt Status */
/* -------- PMC_PLL_ISR1 : (PMC Offset: 0xF4) PLL Interrupt Status Register 1 -------- */
#define PMC_PLL_ISR1_UDR0 (0x1u << 0) /**< \brief (PMC_PLL_ISR1) PLLx Underflow */
#define PMC_PLL_ISR1_UDR1 (0x1u << 1) /**< \brief (PMC_PLL_ISR1) PLLx Underflow */
#define PMC_PLL_ISR1_UDR2 (0x1u << 2) /**< \brief (PMC_PLL_ISR1) PLLx Underflow */
#define PMC_PLL_ISR1_OVR0 (0x1u << 16) /**< \brief (PMC_PLL_ISR1) PLLx Overflow */
#define PMC_PLL_ISR1_OVR1 (0x1u << 17) /**< \brief (PMC_PLL_ISR1) PLLx Overflow */
#define PMC_PLL_ISR1_OVR2 (0x1u << 18) /**< \brief (PMC_PLL_ISR1) PLLx Overflow */

/*@}*/

#endif /* _PIC32CX_PMC_COMPONENT_ */
